       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      *************************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = GABRIEL DUARTE GAB001
      * OBJETIVO: MOSTRAR A STRING HELLO WORLD
      * DATA   = 16/10/2019
      *************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD'.
           STOP RUN.
